[{"sender": "karen.way@piperrudnick.com", "cc": [""], "bcc": [""], "time": "Mon, 18 Sep 2000 08:28:00 -0700 (PDT)", "message": "Kay: The Village's attorney drafted the agreement and therefore we do not have an electronic version -- unfortunately, he does not have email either. The redlined version you are reviewing now reflects only minor changes from that originally executed by ENA approximately a month ago. Please let me know if I can be of any assistance. Thanks! Karen S. Way Piper Marbury Rudnick & Wolfe 203 N. LaSalle Chicago, Illinois 60601 email: karen.way@piperrudnick.com (ph) 312-368-2152 (fax) 312-630-6347 > -----Original Message----- > From: Kay.Mann@enron.com [SMTP:Kay.Mann@enron.com] > Sent: Monday, September 18, 2000 2:16 PM > To: Way, Karen S. - CHI > Subject: RE: Yorkville Annexation Agreement > > > I'm looking at it right now. Could you please email it to me? > > Thanks, > > Kay ____________________________________________________________________________ The e-mail address and domain name of the sender changed on November 1, 1999. Please update your records. The information contained in this communication may be confidential, is intended only for the use of the recipient named above, and may be legally privileged. If the reader of this message is not the intended recipient, you are hereby notified that any dissemination, distribution, or copying of this communication, or any of its contents, is strictly prohibited. If you have received this communication in error, please re-send this communication to the sender and delete the original message and any copy of it from your computer system. Thank you. For more information about Piper Marbury Rudnick & Wolfe, please visit us at http://www.piperrudnick.com/ ____________________________________________________________________________", "recipient": ["kay.mann@enron.com", "mark.gershon@piperrudnick.com"], "subject": "RE: Yorkville Annexation Agreement"}, {"sender": "sheila.tweed@enron.com", "cc": [""], "bcc": [""], "time": "Tue, 13 Jun 2000 11:04:00 -0700 (PDT)", "message": "----- Forwarded by Sheila Tweed/HOU/ECT on 06/13/2000 06:02 PM ----- \tLou Stoler \t06/13/2000 05:38 PM \t\t \t\t To: Sheila Tweed/HOU/ECT@ECT \t\t cc: \t\t Subject: here are the current draft of guaranty form plus jeff's memo Lou ", "recipient": ["kay.mann@enron.com"], "subject": "Here is an additional piece of the Hub deal---the form of guaranty"}, {"sender": "jonesday@jonesday.com", "cc": [""], "bcc": [""], "time": "Mon, 28 Aug 2000 02:13:00 -0700 (PDT)", "message": "_______________________________________________________________ This message and any attachments are intended for the individual or entity named above. If you are not the intended recipient, please do not read, copy, use or disclose this communication to others; also please notify the sender by replying to this message, and then delete it from your system. Thank you. _______________________________________________________________ This is the draft Petition sent by Peoples on Friday. I don't see youor name listed on their distribution list. Gregg Penman has one. I sent comments in a separate e-mail. ---------------------- Forwarded by Boyd J. Springer/JonesDay on 08/28/2000 09:11 AM --------------------------- a.browne@pecorp.com on 08/25/2000 09:50:50 AM Extension: To: t.hermann@pecorp.com, bjspringer@jonesday.com cc: r.delara@pecorp.com, k.donofrio@pecorp.com, s.fiorella@pecorp.com, v.grace@pecorp.com, s.halfin@pecorp.com, m.klyasheff@pecorp.com, w.morrow@pecorp.com, j.nassos@pecorp.com, d.wear@pecorp.com, t.zack@pecorp.com, g.fox@pecorp.com Subject: Petition for Approval of Master Natural Gas Contract Please forward comments to Jerry Fox. <<Pet. for Approval of Master Nat. Gas K>> <<Docket 00-0000 PGL Petition with MEH (Buy-sell)>> ---------------------------------------------------------------- The information transmitted is intended only for the person or entity to which it is addressed and may contain confidential and/or privileged material. Any review, retransmission, dissemination or other use of, or taking of any action in reliance upon, this information by persons or entities other than the intended recipient is prohibited. If you received this in error, please contact the sender and delete the material from any computer. (See attached file: Pet. for Approval of Master Nat. Gas K.doc) (See attached file: Docket 00-0000 PGL Petition with MEH (Buy-sell).doc) - Pet. for Approval of Master Nat. Gas K.doc - Docket 00-0000 PGL Petition with MEH (Buy-sell).doc", "recipient": ["kay.mann@enron.com"], "subject": "Petition for Approval of Master Natural Gas Contract"}, {"sender": "kay.mann@enron.com", "cc": [""], "bcc": [""], "time": "Tue, 15 Aug 2000 02:55:00 -0700 (PDT)", "message": "Here's the Risk Management Policy Gregg has been working on for MEH. Jeff, I don't know if you have seen this, so I thought I would float it by you. David, I'm sending it to you so that you can comment about any concerns you might have relating to the LLC agreement. Thanks, Kay ---------------------- Forwarded by Kay Mann/Corp/Enron on 08/15/2000 09:45 AM --------------------------- \t \t \tFrom: Gregg Penman 08/15/2000 09:34 AM \t To: j.pokorny@pecorp.com, m.nordstrom@pecorp.com, k.classen@pecorp.com, w.morrow@pecorp.com, Paul Burgener/Corp/Enron@ENRON, Laura Luce/Corp/Enron@Enron, Ted Murphy/HOU/ECT@ECT, Vladimir Gorny/HOU/ECT@ECT, Janet R Dietrich/HOU/ECT@ECT, Hunter S Shively/HOU/ECT@ECT, Richard Tomaski/Corp/Enron@Enron, Tim Hermann/Corp/Enron@ENRON, Kay Mann/Corp/Enron@Enron cc: Subject: MEH Risk Management Policy - Revised The attached MEH Risk Management Policy includes one additional revision to yesterday's draft. Please disregard yesterday's version. This is the version that should be reviewed for comments or questions. Thanks, Gregg ", "recipient": ["jeffrey.hodge@enron.com", "dtucker@bracepatt.com"], "subject": "MEH Risk Management Policy - Revised"}, {"sender": "karen.way@piperrudnick.com", "cc": ["\"'rusty.stevens@enron.com'\" <rusty.stevens@enron.com>", "\"'fred.mitro@enron.com'\" <fred.mitro@enron.com>", "\"Gershon", "Mark A. - CHI\" <Mark.Gershon@piperrudnick.com>", "\"Townsend", "Christopher J. - CHI\" <chris.townsend@piperrudnick.com>", "\"Shindler", "Donald A. - CHI\" <Donald.Shindler@piperrudnick.com>"], "bcc": [""], "time": "Mon, 9 Oct 2000 08:52:00 -0700 (PDT)", "message": "Kay: This morning, Rusty requested that we prepare an Option Agreement for the 29 acre parcel west of the Livingston Energy Center. This property could be used as a construction laydown site, but more importantly would provide a sound buffer for the project. It is our understanding that the Option Agreement is to be presented to the property owner at some point next week. We will forward a draft of the agreement to you no later than Monday, October 16, 2000. Please feel free to call me or Don Shindler (312-368-2175) with any questions regarding the agreement. Best regards. Karen S. Way Piper Marbury Rudnick & Wolfe 203 N. LaSalle Chicago, Illinois 60601 email: karen.way@piperrudnick.com (ph) 312-368-2152 (fax) 312-630-6347 ____________________________________________________________________________ The information contained in this communication may be confidential, is intended only for the use of the recipient named above, and may be legally privileged. If the reader of this message is not the intended recipient, you are hereby notified that any dissemination, distribution, or copying of this communication, or any of its contents, is strictly prohibited. If you have received this communication in error, please re-send this communication to the sender and delete the original message and any copy of it from your computer system. Thank you. For more information about Piper Marbury Rudnick & Wolfe, please visit us at http://www.piperrudnick.com/ ____________________________________________________________________________", "recipient": ["kay.mann@enron.com"], "subject": "Schaeffer Property - Livingston County, Illinois"}, {"sender": "fred.mitro@enron.com", "cc": ["Rusty Stevens", "Kay Mann"], "bcc": [""], "time": "Tue, 11 Jul 2000 07:29:00 -0700 (PDT)", "message": "Ben: Attached is the ComEd Letter of Intent to interconnect at the Pontiac TSS. Under the guidelines of Appendix K of ComEd's Open Access Transmission Tarriff, we are required to execute this LOI within 15 days of the date of receipt (7/7/00) in order to maintain our current position (6/12/00) in the ComEd queue. If we execute after 7/22/00, then the date our date in the ComEd queue becomes the date of execution of the LOI. Appendix K provides that once the LOI is executed, ComEd shall provide Enron with an Interconnection Study (IS) and Project Diagram (PD) within 45 days (ComEd has the option to extend another 30 days, if needed). The IS and PD will provide Enron with a description of the upgrades required and an estimate of the proposed allocation of the cost to interconnect. The IS and PD do not provide Enron with information on transmission availability (ie ATC), this would be addressed by the Interconnection Feasibility Study currently in progress by ComEd (I am expecting the results of this IFS in the next 2-3 weeks). ComEd informed me in a discussion yesterday afternoon that their current interpretation of AppendixK provides that if the commercial start date of a proposed IPP project is delayed, that there is no impact to that proposed projects' queue position relative to competing projects provided that all interconnection milestones (LOI, PD, Notice To Proceed, and IA) remain current. ComEd further indicated that such a delay would result in a project with an inferior queue position (i.e. Wizvest) being charged with the necessary system upgrade costs even though their project would come on line prior to the project with the superior queue position. I will request that this interpretation be confirmed by ComEd in writing to Enron. (This interpretation obviously has a large value implication for the Torrence site relative to the Wizvest planned '01 interconnect). I will review this letter on the plane to Houston this afternoon. I believe that it authorizes ComEd to spend up to $100K on engineering related to the interconnect design. It also addresses the ordering and payment responsibilities for long-lead equipment required to facilitate the proposed interconnection. Based upon our development budget discussions earlier this week, we obviously do not want to incurr long-lead equipment charges prior to having a clear value proposition in our sights. I will have recommendations ready for you on these issues by Wednesday. I am simaltaneously forwarding it to Kay Mann for her review so that we will be in a position to move forward to execution prior to 7/22 if we choose to do so. From a legal standpoint, this is ComEd's boilerplate LOI. I believe that we executed a similar LOI for Wilton Center in early 1999 under Des Plaines Green Land Development, L.L.C. Call me if you wish to discuss. Fred ---------------------- Forwarded by Fred Mitro/HOU/ECT on 07/07/2000 05:43 PM --------------------------- <Bruce.L.Tanouye@ucm.com> on 07/07/2000 04:20:33 PM To: fred.mitro@enron.com cc: Robert.D.Koszyk@ucm.com, Carter.C.Culver@ucm.com Subject: Titan Land Development, LLC; Pontiac Letter of Intent Fred, Thank you for your request to Interconnect new generating facilities per your request to, Steven T. Naumann, Transmission Services Vice President. Please execute the Letter of Intent per the attachments to maintain your place in the queue of Applicants for interconnection. <<1XM10!7.7.00.DOC>> <<LOI attachmwn_7_7_00pontiac.doc>> Thank You Bruce L. Tanouye Com*Ed Transmission Services Independent Power Production Services Phone: 708-410-5276 Fax: 708-410-5900 E-Mail: bruce.l.tanouye@ucm.com ****************************************************************************** *** This E-mail and any of its attachments may contain Unicom proprietary information, which is privileged, confidential, or subject to copyright belonging to the Unicom family of Companies. This E-mail is intended solely for the use of the individual or entity to which it is addressed. If you are not the intended recipient of this E-mail, you are hereby notified that any dissemination, distribution, copying, or action taken in relation to the contents of and attachments to this E-mail is strictly prohibited and may be unlawful. If you have received this E-mail in error, please notify the sender immediately and permanently delete the original and any copy of this E-mail and any printout. Thank You. ****************************************************************************** *** - 1XM10!7.7.00.DOC - LOI attachmwn_7_7_00pontiac.doc ", "recipient": ["ben.jacoby@enron.com"], "subject": "Titan Land Development, LLC; Pontiac Letter of Intent"}, {"sender": "rusty.stevens@enron.com", "cc": ["Fred Mitro"], "bcc": [""], "time": "Thu, 6 Jul 2000 11:46:00 -0700 (PDT)", "message": "At Sheila's suggestion, we have decided to bite off the overall PERC tranaction in little pieces, attacking the most critical one's individually as we go. In order for us to focus on the value/commercial issues surrounding the sites in Com-Ed, we need to get the ball in motion on the site sale release from PERC first. This should be a brief - but binding - letter agreement which includes the following points: PERC is hereby authorizing ENA to solicit interests in the Calumet and Torrence sites for the purpose of sale, joint venture, development, or other transactions. ENA will have the sole and exclusive authority to determine whether or not to commit the site(s) to such a commercial transaction, and PERC shall have the right - but not the obligation - to participate in said transaction on an equal ownership basis with ENA. In the event that PERC does not elect to participate in said transaction, ENA shall have the right to undertake such a transaction to the exclusion of PERC, provided that ENA pays PERC the following exercise prices for the site(s) in question: Calumet price = $1,000,000. Torrence price = $100,000. Said exercise price shall be the sole and total compensation for PERC should they elect not to participate in said transaction as proposed by ENA. PERC shall have __ days to give formal written notice of its intent to participate in such transaction from the date of notice by ENA. If PERC elects to participate with ENA on said transaction(s), ENA and PERC will share equally in any proceeds thereof, however, no exercise price shall be payable if PERC elects to participate with ENA. The term of this authorization shall be for 90 days from the date of execution and 10 days evergreen thereafter unless cancelled by either party by two days written notice. This agreement is binding on the parties hereto, provided however, that it shall be conditioned upon PERC and Enron (or an affiliate or agent thereof) executing a mutually agreeable document to effect the transfer of ownership of their turbines for a purchase price of $56,000,000. The next item we will need is a authorization document allowing us (Enron Canada/ENA) to negotiate with ABB for changes needed in the ABB contract.", "recipient": ["kay.mann@enron.com"], "subject": "PERC Authorization for Sale of Sites"}, {"sender": "gregg.penman@enron.com", "cc": [""], "bcc": [""], "time": "Tue, 20 Jun 2000 06:17:00 -0700 (PDT)", "message": "Per my voicemail, attached is a list of business items that need to get put in place in order for Midwest Energy Hub LLC to be fully operational. There are probably others that I have missed and would welcome any additions you may have. One thing I did not include was any internal Enron approvals, (DASH, Legal risk memo) that may be necessary. Call me when you have a chance to talk through the list. Thanks, Gregg ", "recipient": ["kay.mann@enron.com"], "subject": "Chicago Legal Doc Status"}, {"sender": "kay.mann@enron.com", "cc": [""], "bcc": [""], "time": "Fri, 8 Sep 2000 07:48:00 -0700 (PDT)", "message": "David, Please change the date on the draft so that we won't confuse it with the prior drafts. I would delete \"specifically\" from 2.10 (c), and add \"or later ratify such transaction\" (or something to that effect), just in case they later learn and accept the transaction. In 2.10 (x), add to \"due to an inability to pay, or other credit reason\". In (y), add \"or a contractual defense to payment\" [could be force majeure, etc] Again in 2.10, third sentence from the end \"any interest, penalties, attorneys fees and court costspayable by the Hub Shipper...; 3.3 Delete \"prior\" before \"approval\", and add \"or ratification\" in the redlined section on refunds. Thanks, Kay", "recipient": ["dtucker@bracepatt.com"], "subject": "Hub agency/my comments"}, {"sender": "teresa.callahan@enron.com", "cc": ["Deb Korkmas", "Kay Mann", "Lillian Bailey"], "bcc": [""], "time": "Fri, 15 Sep 2000 09:29:00 -0700 (PDT)", "message": "Per our telephone conversation this morning, please send me a return e-mail granting me the authorization to amend the consents and amendment documents to reflect the change you requested from initial cap Enovate to lower case enovate on Name Change documents and Illinois qualification. Please confirm which states marketing materials will actually as opposed to potentially be distributed in so that we may qualify in those respective states. Since we can normally qualify an entity in states relatively quickly we will be able to qualify in states as need be. Thanks. Teresa A. Callahan Corporate Secretary's Office EB4804 Ext. 58444", "recipient": ["russell.murrell@enron.com"], "subject": "Authorization to revise documents to reflect change from Enovate to"}, {"sender": "boyd_j._springer@jonesday.com", "cc": [""], "bcc": [""], "time": "Tue, 20 Jun 2000 12:34:00 -0700 (PDT)", "message": "_______________________________________________________________ This message and any attachments are intended for the individual or entity named above. If you are not the intended recipient, please do not read, copy, use or disclose this communication to others; also please notify the sender by replying to this message, and then delete it from your system. Thank you. _______________________________________________________________ The following discusses the regulatory issues raised at our June 14 meeting with Peoples. 1. Expanded termination right for unacceptable \"Regulatory Approval\". As discussed prior to the meeting, language of Sects. 1.1, 1.11, 10.2 and 15.1(f) was changed to provide a termination right in the event that an unacceptable regulatory order is issued after initial approval of the Agency Agreement, but during its term. Peoples explained at the meeting their view that a termination right should exist in the event of an adverse rate order (e.g., Illinois Commission order imputing what Peoples believes to be an unreasonably high level of Hub revenue and, therefore, unaccpetably lowering retail gas rates) or FERC determination that, based on Hub operations, Peoples is in jeopardy of losing its status as a Hinshaw pipeline. These were examples of the types of orders Peoples has in mind. As proposed in our draft, either party would have a termination right in the event that the Agency Agreement is not initially approved by the ICC on acceptable terms. Under our approach, however, the parties would have to live with ;later adverse regulatory orders unless an order had the effect of revoking the Hub's operating authority. My view is that we could reasonably agree to a termination right (similar to Sect. 11.1 (vi) and (vii) of the LLC Agreement) which grants a termination right, \"in the event that a Jugment determines that, as a result of Hub Transactions, Peoples is subject to comprehensive rate regulation as a natural gas company or public utility by the FERC; or loses its status as an exempt Hinshaw pipeline under Section 1(c) of the Natural Gas Act.\" I would suggest that we otherwise stay with our original language re regulatory approvals. Once Peoples obtains an order from the ICC which both parties accept, Peoples should be willing to assume the risk (which,in my opinion is minimal) that an adverse rate decision would cause it to wish to terminate the Agency Agreement. (David suggested at the meeting that, as another option, we could agree to a termination right due to an adverse regulatory order if Peoples chooses to discontinue all Hub Transactions, but I am not sure that we need to offer this at this stage.) The word \"required\" should be restored to Definitions 1.1 and 1.11. 2. Extended Hub Services. Peoples agreed at the meeting that there should be compensation after termination of the Agreement for an extended Hub Service presented during the Agreement's term. To make this clear,the words \"during the term of this Agreement\" should be deleted from Sect. 7.1(ii). The deleted wording of 7.2 should be restored, and to that Section we could add a sentence: \"The right to compensation established under Section 7.2 (ii) for an Extended Hub Service shall survive the termination of this Agreement.\" Also, in Section 15.4, I believe the reference to Sect. 3.3 should be to 7.2. 3. \"Hub Services\"-Sect. 1.17. Based on discussion at the meeting, I understand that there is a need to address the \"two county rule\" in the Agreement. In connection with this, there was discussion of the need to change the description of the Hub Services to make clear that the services are incidental to the primary uses of the Hub Facilities. As I understand it, the description of the services both for the Agreement and the GTC may be changed to replace the existing references to transportation services a reference to \"wheeling\" serivces. This should be addressed when the revised terms of the GTC are available. I believe the business people also are discussing a procedure for approval of transactions to ensure compliance with the two county rule, and are preparing a list of types of transactions which will be pre=approved. 4. Adjustment of Administrative fee for refunds. Our position, as discussed at the meeting, is that Sect. 7.3 which provides for retroactive adjustment of the administrative fee in the event of a refund should be deleted. In support, we point out that MEH relies on a specific fee value in seeking out transactions and the fee shouldn't change after-the-fact as the result of a refund. Peoples argues that a revenue-based fee should be adjusted if there is a change in the realized level of revenue. This was left as an open point. Peoples acknowledged at the meeting that the proposed fee adjustment would occur only due to a rate refund. This means that the administrative fee could be adjusted retroactively only if a transaction occurs under a newly proposed rate which is part of the Operating Statement, but subject to refund at a level higher than the previously approved rate but lower than the maximum price under the new rate. The only portion of the fee which is at risk is the portion produced by use of a rate above the previously approved level. If, for example, a 10% increase is proposed and made effective subject to refund. A risk arises only if the negotiated price is at 90% of the maximum or above. If it is, the refund risk to MEH is its percentage of the revenue produced by the rate above the 90%above. If the rate is 95% of the maximum, the amount at risk is 5% of MEH's 20% portion of the revenue, or 1% of the fee. A refund at this level would occur in the example only if FERC approves no rate increase and requires a refund of all subject to refund revenue. If FERC approves all or part of the increase, the refund risk is reduced. Therefore, the decision should not greatly effect the economics of the deal. If we decide to allow some adjustment of the fee for refunds, the language should make clear that we are including only \"refunds related to a finding by FERC that a rate in effect subject to refund is excessive and should be reduced.\" 5. Also with respect to refunds (required for any cause), Peoples agreed at the meeting to provide the necessary funds. We could adjust the language of Sect. 3.3 to read: \"Peoples will pay to MEH all funds necessary to effect such refunds on or before the earlier of : (i) the date prescribed by a Law or Judgment for payment of such refunds; or (ii) ten (10) business days after receiving written notice of the need for such payment.\" (Note: Because refunds are required by FERC Order, Peoples would always know when the refund has to be paid.) 6. Admin. Fee. After the business discussion of intended coverage of the monthly fixed fee, we should reconsider the deleted language in 18.3 regarding reimbursement of costs incurred by MEH on Peoples' behalf. 7. Nomination and Scheduling on Pipelines. Sect. 2.5. Peoples proposes to delete the language we added which requires Peoples to make any necessary nominating or scheduling changes on interstate pipelines for receipt and delivery of gas at its city gate for its own account in order to effectuate Hub transactions. The language went on to also require Peoples to arrange for delivery of gas at a secondary delivery point by Displacement Delivery. At the meeting, Peoples took the position that it is already required to handle nominations and scheduling on pipelines by terms of the GTC. Peoples also indicated that, due to the nature of the Hub Facilities and transactions, the Delivery Points must be on Peoples' system and that Displacement Delivery to a point which Peoples can access under one of its pipeline agreements is not feasible for a Hub Serivce. (Note: In the Northern Illinois Gas Hub Agreement, the utility agreed to the provision we proposed.) With regard to the second part of our proposed sentence re delivery by displacement at a secondary point off-system, I agree that the GTC seems to contemplate delivery on Peoples system for the various types of transactions covered. Perhaps we can delete section \"(b)\" of our proposed sentence. I would like to know whether the business people have comments on this. With regard to the part (a) (the requirement that Peoples make nominanting and scheduling changes needed to effectuate Hub transactions), however, I do not find any language in the GTC which makes clear that this is Peoples' responsibility. Also, at our preliminary meeting, Laura indicated that this was an important provision to restore. (I believe Laura mentioned only part a, but need to check this.) Therefore, I believe we should propose, at least, to restore the sentence through part a, subject to verification with Laura and Gregg. 8. Grounds to Refuse Trransaction. Also, in 2.5, Peoples included as one of the grounds to refuse a Hub Service presented by MEH, a conclusion by Peoples that \"Hub Capacity is deemed unavailable by Peoples due to the service requirements of Peoples' utility customers.\" We pointed out at the meeting that the GTC (Sect. 8) specifies all circumstances when a Hub Serivce can be refused and that this provision is not one of the specified situations. Once a firm transaction is established under the GTC, it has equal scheduling priority with other firm interstate and intrastate firm transactions. Peopels agreed that this item (Item 3) can be deleted. I believe Peoples wishes to revise (1) to read: \" permitted by the terms of the GT&C, or required by any Law and Judment:. 9. Sect. 3.5. Peoples proposes to delete our proposed Section 3.5 which requires Peoples to use its best efforts to minimize imbalances experienced by Hub Shippers through use of management services offered under pipeline tariffs. Such services should be offered soon under Order 637 compliance filings. This provision was inserted as part of a paragraph in Peoples' initial draft which would have required MEH to compensate Peoples for imbalances experienced on pieplines as a result of Hub Transactions. Peoples had taken this provision from the NIGAS Hub agreement. In response, we had included the wording of 3.5 to, at least, require best efforts to minimize imbalances on the pipelines. Peoples now proposes to delete all of this on the ground that imbalances on the pipelines are the responsibility of the Hub Shippers, and not of Peoples or MEH. The GTC has provisions covering the responsibility of shippers to address imbalances on the Hub Facilities, and Peoples points to the Parking and Loaning Service for Shippers to address imbalances. In reviewin g this, I believe Peoples is right. Because the language requiring MEH to address imbalnaces on the pieplines has been deleted, I think we can delete the language of 3.5 requiring Peoples to use best efforts to minimize those imbalances. 10. Sect. 2.2 Responsibility for regulatory compliance. Peoples proposed changes to the language we inserted in 2.2 in the second sentence from the end which indicated that Peoples is responsible for compliance with the GTC. Peoples proposed that each party be responsible. At the meeting, we explained that this language was included to recognize FERC precedent requiring that, in circumstances such as this, the agreement must identify the party responsible for regulatory complaince and that party must be the certificate holder. Peoples agreed at the meeting that our original language for this sentence should be restored. 11. The Agreement (6.1) presently provides that Peoples, in its sole discretion, may propose changes in the GTC. David indicated at the meeting that, at a minimum, MEH should be advised of changes in advance and provided with an opportunity for comments before such changes are proposed. Peoples agreed to include such a provision. Also, Peoples agreed that Section 5.1 should include a representation that Peoples has provided MEH with a current copy of the presently effective GT&C. 12. Section 1.13. GTC. Peoples agreed at the meeting that the definition of GT&C should be changed to end after the words \"from time to time\". (This eliminates the refernce to modification in Peoples' sole discretion.) 13. Section 1.22 and 1.26. Peoples agreed that the definitions should refer only to MEH and Peoples (and not to \"controlled\" persons) 14. Section 1.15. Peoples agreed that the definition of Hub Capacity could be changed to eliminate the reference to determination by Peoples in its sole discretion. The determination should be \"in accordance with the GT&C.\" Peoples suggested that a standard of \"good faith\" or \"commercially reasonable\" would be acceptable. 15. Section 5.1. Peoples agreed at the meeting that Section 5.1 could be revised to eliminate the refernce to Laws and Judgments with a materially adverse effect. Peoples agrees that there should be a representation that the Agreement does n ot violate \"any Judgment or Law applicable to it\",as originally proposed. 16. Section 2.9. The discussion at the meeting indicated that Peoples may accept use of a standard of \"commercially reasonable\" with regard to its judgment under 2.9(i) and MEH's obligation to perform in accordance with the Operating Statement, Laws and Judgments in 2.9(ii). I was surprised that Peoples suggested this re 2.9. As I understand it, the concern is that MEH should not be liable for contract damages in the event that it acts in a commercially reasonable manner, but cannot, for some reason, comply with the GTC or a Law or Judgment. I wonder if we can accomplish this result with language in a later section of the Agreement regarding liability. My concern is that a provision indicating that MEH's responsibility for compliance with regualtory requirements, Laws and Judgments is limited to best efforts or items it knows about may raise a red flag for the regulators. I would like to discuss whether there is another way to deal with potential liability without changing 2.9(ii) to refer to \"best\" or \"commercially reasonable\" efforts. Let's discuss tomorrow. 17. Section 10.1. Filing for Governmental Approval. At the meeting, Peoples indicated that, although it believes it should have sole control over regulatory filings, Peoples will agree to include a provision indicating that:\"Prior to the filing of applications, pleadings or testimony related to approval for operation of the Hub, Peoples will provide copies of such materials to MEH, and consider comments provided by MEH.\" We should discuss with the business peoples whether this is sufficient, and how specific this provision should be. The language here would be comparable to that inserted in 6.1 regarding the right to review and comment on changes to the GTC. 18. Dissolution of MEH. Peoples agreed that a portion of our proposed 15.1(f), up to the word \"terminated\" on line 2 should be restored. Peoples only concern in proposing deletion was that the LLC Agreement might be requested by the ICC Staff due to the reference. As revised, the reference is removed. 19. Confidentiality. Peoples agreed to re-think the provisions of 17.1 re confidentiality of the compensation provions of Articles 3 and 7. This was not confidential in the NIGAS approval proceeding. Because the ICC Staff will be aware of the provisions, I do not know why Peoples proposes to require the procedures needed to maintain confidentiality of these provisions in the approval proceeding. 20. Section 18.4. Peoples agreed to mutual review and agreement re forward-looking statements re the Hub. 21. Section 2.4. At the meeting, Peoples agreed that the third sentence is confusing and should be revised. I would suggest: \" Peoples will inform MEH promptly after it learns of information indicating that a revision to information regarding Hub Capacity should be made or proposed in accordance with this Section.\" Tomorrow, I will re-review my notes to make sure that I have covered the regulatory areas. I have notes on other sections also if you have any need for them. I'll give you a call tomorrow after I return from a morning hearing around 11:00am. ", "recipient": ["dtucker@bracepatt.com", "cdade@bracepatt.com", "kay.mann@enron.com"], "subject": "Regulatory Issues"}, {"sender": "kay.mann@enron.com", "cc": [""], "bcc": [""], "time": "Tue, 23 Jan 2001 06:18:00 -0800 (PST)", "message": "---------------------- Forwarded by Kay Mann/Corp/Enron on 01/23/2001 02:18 PM --------------------------- \tEnron North America Corp. \t \tFrom: Kay Mann 09/19/2000 03:44 PM \t To: Herman Manis/Corp/Enron@ENRON cc: Subject: ledford-titan option to purchase , livingston county.DOC Speaking of options.... ---------------------- Forwarded by Kay Mann/Corp/Enron on 09/19/2000 03:44 PM --------------------------- \"Way, Karen S. - CHI\" <karen.way@piperrudnick.com> on 09/15/2000 02:04:35 PM To: \"'kay.mann@enron.com'\" <kay.mann@enron.com>, \"'fred.mitro@enron.com'\" <fred.mitro@enron.com>, \"'rusty.stevens@enron.com'\" <rusty.stevens@enron.com> cc: \"Shindler, Donald A. - CHI\" <Donald.Shindler@piperrudnick.com> Subject: ledford-titan option to purchase , livingston county.DOC <<ledford-titan option to purchase , livingston county.DOC>> Attached hereto, please find the draft Ledford-Titan Option to Purchase Real Estate and Grant of Easement for your review. Per my emails with Rusty, we intend to messenger the execution copies to the Ledford's attorney on Monday at mid-day. Therefore, please send me your comments at your earliest convenience. Thank you. ____________________________________________________________________________ The e-mail address and domain name of the sender changed on November 1, 1999. Please update your records. The information contained in this communication may be confidential, is intended only for the use of the recipient named above, and may be legally privileged. If the reader of this message is not the intended recipient, you are hereby notified that any dissemination, distribution, or copying of this communication, or any of its contents, is strictly prohibited. If you have received this communication in error, please re-send this communication to the sender and delete the original message and any copy of it from your computer system. Thank you. For more information about Piper Marbury Rudnick & Wolfe, please visit us at http://www.piperrudnick.com/ ____________________________________________________________________________ - ledford-titan option to purchase , livingston county.DOC ", "recipient": ["kathleen.carnahan@enron.com"], "subject": "ledford-titan option to purchase , livingston county.DOC"}, {"sender": "dtucker@bracepatt.com", "cc": ["<stweed@enron.com>"], "bcc": [""], "time": "Thu, 15 Jun 2000 10:55:00 -0700 (PDT)", "message": "I enjoyed getting to know you yesterday. By the way, I wanted to follow up on a few items related to the Hub transaction: 1. The competition restrictions commence August 10th (see the definition of \"Restricted Period\" in the agreement), but no DASH was circulated at the time the LLC agreement was signed. I believe it was intended that some other approval/sign-off procedure would be implemented after the closing. Achieving the appropriate internal Enron sign-offs is critical, so please let us know what (if anything) we can do to assist in this process --- whatever it might be. 2. Our deadline for proposing a list of grandfathered contracts to PMW is June 25th. That's a week from next Sunday, and it is the same date by which we are supposed to finalize the Agency Agreement. Since it appears that Peoples does not expect to get back to us for at least a week on the Agency Agreement, we might want to think about amending the LLC agreement to push the deadline back. 3. Other matters on our \"to-do\" list include (i) filing qualifications to do business where necessary outside Illinois, (ii) providing each of Enron's restricted affiliates' marketing representatives with a copy of the Restricted Activities provisions, (iii) putting the member guaranty arrangements in place, and (iv) finalizing the Risk Guidelines. 4. Termination rights are triggered if we fail to meet the deadlines in 2 and 4(iv) above. Thanks! DT", "recipient": ["kay.mann@enron.com"], "subject": "Reminders"}, {"sender": "kathleen.carnahan@enron.com", "cc": [""], "bcc": [""], "time": "Tue, 30 Jan 2001 05:15:00 -0800 (PST)", "message": "I can't open the attachment, can you? K-", "recipient": ["kay.mann@enron.com"], "subject": "Re: Shaeffer redline"}, {"sender": "rusty.stevens@enron.com", "cc": ["Fred Mitro", "karen.way@piperrudnick.com"], "bcc": [""], "time": "Mon, 21 Aug 2000 05:02:00 -0700 (PDT)", "message": "I spoke to Karen Way at Piper-Marbury-Rudnick&Wolfe and we decided that the best way to handle the document flow is for you to send the docs. electronically to Karen and she will Fed-X out the originals for execution to their attorney - Ed Legner. Karen has dealt with Legner recently on Green, so she should be able to push him to move the ball so we can get this done quickly. We can also include a marked as draft hard copy for markups if he has a lot of changes. Since he just reviewed the Green doc. very recently, it should be fine as is since we are only changing the following: We want to limit the means by which we are able to get the option premium back to their not being able to convey the tract. They have an imbedded \"put\" option on the house if we begin to build and haven't exercised our call. The commercial terms are $4000 for 18 months, and an 18 month extension for another $4000, Exercise price is $185,000. Karen will get together a legal description that will suffice for purposes of this document. Our goal is to get this inked in the next 5-10 days.", "recipient": ["kay.mann@enron.com"], "subject": "Fehr Contract"}, {"sender": "gregg.penman@enron.com", "cc": [""], "bcc": [""], "time": "Tue, 20 Jun 2000 07:20:00 -0700 (PDT)", "message": "Here is some more info. regarding the Affiliate Master Purchase and Sale Agreement that is on the list. Attached is a draft agreement prepared by Simon Halfin at Peoples. It is based on the 3rd party contract that Jeff Hodge is working on with Peoples. The agreement is intended to be a master contract that would facilitate a blanket of structured term transactions between the utilities (Peoples Gas Light and Coke Co. and North Shore Gas) and MEH. It will be filed with the Illinois Commerce Commission for approval. My understanding is that the transactions will still be subject to the annual prudency process of each utility. I am not sure your strategy on this one, but would think that a combination of you, Jeff Hodge, and Boyd would be most effective. I understand that Dynegy and Nicor filed a similar agreement as part of their Hub Agency Agreement that Boyd has reviewed. I am sure he can confirm that or not. Thanks, Gregg ", "recipient": ["kay.mann@enron.com"], "subject": "Affiliate Master Purchase and Sale Agreement"}]